<template>
  <demo-section>
    <demo-block :title="$t('basicUsage')">
      <ms-water-mark
        class="text-container"
        content="Miss"
      >
        <p class="text">
          后来她知道，情窦初开时，会对某个人比旁人关注多一些，但那种感觉会在一段时间后慢慢遗失，然后再去关注另一个人。
          这是每个人在成长路上必经的一环，她只是恰好把视线停在了一起长大的萧楚衍身上。
          这种感觉不叫初恋，而是初爱，最初的爱，纯纯如新鲜的白色牛奶，最终将成为生命里一抹淡之又淡的色彩。
        </p>
        <p class="text">
          “一辈子的爱人，不是一场轰轰烈烈的爱情，也不是什么承诺和誓言。而是当所有人都离弃你的时候，只有他在默默陪伴着你。当所有人都在赞赏你的时候，只有他牵着你的手，嘴角上扬，仿佛骄傲的说，我早知道。不要因爱人的沉默和不解风情而郁闷，因为时间会告诉你：越是平凡的陪伴 就越长久。”
        </p>
        <p class="text">
          少年时我们追求激情，成熟后却迷恋平庸。在我们寻找、伤害、背离之后，还能一如既往地相信爱情，这是一种勇气。
        </p>
        <p class="text">
          少年时我们追求激情，成熟后却迷恋平庸。在我们寻找、伤害、背离之后，还能一如既往地相信爱情，这是一种勇气。
        </p>
        <p class="text">
          不要试图去解释这个世界上任何的误解和扭曲，存在的都是真理，任何人的成功，都不是虚头，他们一定付出了你没有想到的努力和代价，才华、机遇、运气、努力、外貌，甚至是不光彩的事情，都是存在，没什么值得怀疑。
        </p>
        <p>
          世间正是因为存在着大多数的不理解、不解释，才导致了最终的悲伤。每个人都学会了伪装，总是笑的那么假，哭的很隐藏。
        </p>
      </ms-water-mark>
    </demo-block>
  </demo-section>
</template>

<style lang="less">
.text-container {
  padding: 32px;
}

.text {
  line-height: 1.5;
}
</style>
